"app_name"="surespot";
"friends"="Amici";
"menu_settings"="Impostazioni";
"username_label"="Username:";
"password_label"="Password:";
"title_activity_notifications"="Notifiche";
"export_sd"="Esegui backup sulla memoria del dispositivo";
"import_sd"="Ripristina dalla memoria del dispositivo";
"delete_identity_user"="Elimina identità: %@";
"import_identities"="Ripristina identità...";
"create_identity_label"="Crea nuova identità...";
"no_identity_exported"="Nessun backup di identità salvato";
"no_identity_imported"="Nessuna identità ripristinata";
"no_identity_deleted"="Nessuna identità eliminata";
"identity_imported_successfully"="Identità ripristinata con successo";
"could_not_import_identity"="Impossibile ripristinare l'identità";
"could_not_restore_identity_name"="Impossibile ripristinare l'identità %@";
"camera_init"="Avviamento fotocamera";
"uploading_image"="Caricamento immagine";
"could_not_upload_image"="Impossibile caricare l'immagine";
"image_successfully_uploaded"="Immagine caricata correttamente";
"select_image"="Seleziona immagine";
"capture_image"="Scatta foto";
"assign_image"="Assegna immagine";
"logout"="Log out";
"settings"="Impostazioni";
"no_friends"="Nessun amico... per ora. Invita degli utenti di surespot inserendo il loro nome utente qui sotto.";
"help_invite"="Invita degli utenti surespot inserendo il loro nome utente nella sezione home.";
"navigate_between_chat_tabs"="Naviga tra le schede trascinando.";
"help_holdmessage"="Tieni premuto su un messaggio per visualizzare le opzioni.";
"help_holdfriend"="Tieni premuto su un amico per visualizzare le opzioni.";
"help_imageZoom"="Tocca l'immagine per ingrandirla.";
"incorrect_password_or_key"="Password o chiave non corrette";
"no_such_user"="Utente inesistente";
"roll_keys"="Genera nuove coppie di chiavi";
"regenerate_keys"="Genera nuove coppie di chiavi";
"could_not_create_new_keys"="Impossibile creare nuove coppie di chiavi";
"keys_created"="Nuove chiavi create con successo, esegui il backup dell'identità";
"close_tab"="Chiudi scheda";
"action_settings"="Impostazioni";
"no_messages"="Nessun messaggio";
"delete_message"="Elimina messaggio";
"block_underline"="Blocca";
"ignore_underline"="Ignora";
"accept_underline"="Accetta";
"crash_toast_text"="Houston, abbiamo un problema";
"crash_dialog_title"="surespot è andato in crash";
"crash_dialog_text"="Dobbiamo confessare che si è verificato un errore inaspettato.\nPer piacere aiutaci a risolvere il problema toccando OK per inviare una segnalazione di errore che non contiene informazioni personali.";
"crash_dialog_comment_prompt"="Puoi aggiungere dei commenti riguardo al problema qui sotto:";
"crash_dialog_ok_toast"="Grazie!";
"external_invite_message"="Vorrei chattare con te in privato su surespot. Clicca %@ per installare l'app e invitarmi come amico.";
"help_backupIdentities1"="Poiché surespot usa chiavi cifrate che non sono mai caricate sui nostri server, se perdi il tuo telefono, disinstalli e reinstalli l'app, o cancelli i dati dell'app, non potrai più ricollegarti a meno che tu non abbia fatto un backup in passato.";
"help_backupIdentities2"="surespot può salvare le tue identità nella cartella dei Documenti dove possono essere scaricate con iTunes File Sharing, oppure può usare Google Drive, disponibile nelle impostazioni.";
"help_backup_drive2"="Le tue identità saranno salvate su Google Drive nella cartella \"surespot identity backups\". Le identità possono essere ripristinate dalla schermata di creazione utente o nelle impostazioni di gestione delle identità.";
"help_messageHistory"="surespot salva una cronologia di 1000 messaggi. Quando raggiungi il limite di 1000 messaggi, i tuoi messaggi più vecchi verranno cancellati, così che avrai sempre 1000 messaggi (criptati) salvati sul server. Naturalmente puoi cancellare uno qualunque dei tuoi messaggi in ogni momento.";
"notification_title"="surespot";
"notification_message_from"="%1$@: Nuovo messaggio da %2$@.";
"notification_invite_from"="%1$@: Invito da %2$@.";
"notification_invite_accept_from"="%1$@: %2$@ ha accettato il tuo invito.";
"about_version"="versione: %@";
"surespot"="surespot";
"invite"="invita";
"no_contact_data_selected_or_entered"="Nessun dato di contatti selezionato o inserito";
"invite_progress_text"="Creazione invito in corso";
"login"="Log in";
"login_progress"="Login in corso";
"login_check_password"="Impossibile effettuare il login, assicurati che la password sia corretta.";
"login_try_again_later"="Errore nel login, riprova più tardi.";
"login_max_identities_reached"="Spiacente, hai superato il limite di identità che puoi creare (%d). \n\nLe identità possono essere eliminate nelle impostazioni di gestione identità dopo aver eseguito l'accesso.";
"local_cache_cleared"="Cache locale svuotata";
"qr_pre_username_help"="La lettura del codice QR inviterà";
"qr_post_username_help"="ad essere tuo amico / installare surespot";
"send"="Invia";
"main_action_bar_right"="a";
"could_not_upload_friend_image"="Impossibile caricare l'immagine dell'amico";
"delete_all_confirmation"="Sei sicuro di voler cancellare tutti i messaggi?";
"delete_all_title"="Cancella tutti i messaggi";
"ok"="Ok";
"cancel"="Annulla";
"friend_self_error"="Sfortunatamente non puoi essere amico di te stesso.";
"has_been_invited"="%@ ha ricevuto la tua richiesta di amicizia.";
"has_accepted"="%@ ha accettato la tua richiesta di amicizia.";
"user_does_not_exist"="L'utente non esiste.";
"you_are_already_friends"="Siete già amici.";
"already_invited"="Hai già invitato questo utente.";
"could_not_invite"="Invito non riuscito, riprova più tardi.";
"keys"="Chiavi";
"generating_keys_progress"="Generazione e caricamento delle nuove chiavi";
"backup_identities_again_keys"="Poiché le chiavi della tua identità cambieranno, fai il backup di questa identità dopo aver completato l'operazione.";
"backup_identities_again_password"="Poiché verrà cambiata la password della tua identità, fai il backup di questa identità dopo aver completato l'operazione.";
"create_new_keys_for"="Crea nuove chiavi per %@";
"enter_password_for"="Inserisci la password di surespot per %@";
"enter_username_and_password"="Inserisci username e password, oppure ripristina un'identità dal menu.";
"usernames_case_sensitive"="Gli username sono case-sensitive";
"aware_username_password"="quindi ricordatene quando li condividi con altri. La password deve essere lunga almeno 8 caratteri e contenere simboli.";
"warning_password_reset"="ATTENZIONE: Non esiste NESSUN MODO per ripristinare la tua password o username in surespot, quindi assicurati di ricordarteli!";
"create_user_progress"="Creazione dell'utente e generazione di una coppia di chiavi in corso";
"create"="Crea";
"passwords_do_not_match"="Le password non corrispondono";
"username_exists"="Questo username esiste già, per favore scegline un altro.";
"user_creation_throttled"="Troppi tentativi di creazione utente, riprova più tardi";
"signup_update"="Aggiorna surespot per creare un nuovo utente";
"could_not_create_user"="Impossibile creare l'utente, riprova più tardi";
"pay"="Dona";
"what_you_like"="quanto vuoi";
"billing_could_not_enable"="Impossibile abilitare il pagamento tramite applicazione";
"billing_purchase_error"="Errore, acquisto non completato.";
"billing_paypal_link_email_subject"="Link per la donazione libera con paypal";
"billing_paypal_link_email_body"="Grazie per la donazione a surespot! Il link paypal è:";
"none"="Niente";
"pwyl_paypal_send_to_self"="Inviati il link per email";
"billing_bitcoin_copied_to_clipboard"="%@ copiato nella clipboard";
"billing_bitcoin_email_subject"="Indirizzo per la donazione libera con bitcoin";
"billing_bitcoin_email_body_address"="Grazie per la donazione a surespot! L'indirizzo bitcoin è: %@";
"billing_bitcoin_email_body_qr"="Il codice QR può essere visualizzato qui: %@";
"could_not_open_bitcoin_wallet"="Apertura del portafoglio bitcoin non riuscita";
"message_sending"="Invio...";
"message_loading_and_decrypting"="Caricamento e decrittazione...";
"could_not_login_to_server"="Login al server non riuscito";
"could_not_connect_to_server"="Connessione al server non riuscita";
"autoinvite_user_exists"="La tua lista di amici contiene già %@";
"loading_latest_messages_failed"="Caricamento degli ultimi messaggi non riuscito";
"could_not_delete_message"="Cancellazione del messaggio non riuscita";
"could_not_delete_messages"="Cancellazione dei messaggi non riuscita";
"could_not_delete_friend"="Cancellazione dell'amico non riuscita";
"could_not_set_message_lock_state"="Impossibile settare il messaggio nello stato \"bloccato\"";
"menu_save_to_gallery"="Salva nella galleria";
"menu_resend_message"="Reinvia messaggio";
"menu_lock"="Blocca";
"menu_unlock"="Sblocca";
"image_saved_to_gallery"="Immagine salvata nella galleria";
"error_saving_image_to_gallery"="Errore nel salvataggio dell'immagine nella galleria";
"delete_message_confirmation_title"="Sei sicuro di voler cancellare questo messaggio?";
"message_error_decrypting_message"="Errore nel decrittare il messaggio";
"could_not_respond_to_invite"="Risposta all'invito non riuscita, riprova più tardi.";
"friend_status_is_deleted"="è stato cancellato";
"friend_status_is_invited"="è stato invitato";
"friend_status_is_inviting"="sta invitando";
"menu_close_tab"="Chiudi scheda";
"menu_assign_image"="Assegna un'immagine";
"menu_delete_all_messages"="Cancella tutti i messaggi";
"menu_delete_message"="Cancella messaggio";
"menu_delete_friend"="Cancella amico";
"delete_friend_confirmation"="Sei sicuro di voler cancellare l'amico: %@?";
"password"="Password";
"change_password_actionbar_right"="Cambia";
"change_password_progress"="Cambio password in corso";
"could_not_change_password"="Cambio password non riuscito";
"password_changed"="Password cambiata, esegui il backup dell'identità";
"delete"="Cancella";
"delete_identity_progress"="Cancellazione identità";
"could_not_delete_identity"="Cancellazione identità non riuscita";
"identity_deleted"="Identità cancellata";
"backup"="Backup";
"backup_identity"="Backup identità %@";
"backed_up_identity_to_path"="Eseguito il backup dell'identità %1$@ in %2$@";
"restore"="Ripristina";
"restore_identity"="Ripristina l'identità %@";
"assign"="Assegna";
"could_not_load_image"="Impossibile caricare l'immagine";
"image"="Immagine";
"pan_and_zoom"="Muovi e fai zoom";
"done"="Fatto";
"message_error_unauthorized"="Errore nell'invio del messaggio: non autorizzato";
"error_message_throttled"="Errore nell'invio del messaggio: throttled";
"error_message_generic"="Errore nell'invio del messaggio";
"error_message_resend"="Invio fallito - tieni premuto per reinviare";
"pwyl_send_to_dialog_title"="Inviare a?";
"open_link_in_browser"="Apri link nel browser";
"send_link_in_email"="Inviati il link per email";
"via_bitcoin"="VIA BITCOIN";
"copy_address_to_clipboard"="Copia l'indirizzo nella clipboard";
"send_address_and_qr_code_in_email"="Mandati via mail l'indirizzo ed il codice QR";
"open_bitcoin_wallet"="Apri il portafoglio bitcoin (se supportato)";
"select_identity"="Seleziona identità";
"current_password"="Password attuale";
"new_password"="Nuova password";
"confirm_password"="Conferma password";
"change_password"="Cambia password";
"delete_identity_message_warning"="Cancellando un'identità tutti i messaggi mandati da tale identità saranno cancellati. Questa operazione non può essere annullata.";
"identity_colon"="Identità:";
"backup_location_note"="Nota: questa potrebbe essere o meno la scheda SD rimovibile, a seconda del tuo dispositivo.";
"invite_others"="Invita altri a comunicare con te privatamente tramite surespot condividendo con loro un link di invito automatico.";
"generate_new_keypairs"="Genera una nuova coppia di chiavi per l'identità selezionata e revoca la coppia attuale. Tutti gli altri dispositivi (per es. i telefoni persi o rubati) non potranno più accedere a surespot con l'identità selezionata.";
"username"="Username";
"create_identity"="Crea identità";
"clear_local_cache"="Risincronizza con il server";
"delete_all_messages"="Cancella tutti i messaggi";
"pay_what_you_like"="Donazione libera";
"delete_identity"="Cancella l'identità";
"surespot_help"="Aiuto";
"could_not_backup_identity_to_google_drive"="Backup dell'identità su Google Drive non riuscito";
"identity_successfully_backed_up_to_google_drive"="Backup dell'identità su Google Drive riuscito";
"restore_local"="Ripristina dalla memoria del dispositivo";
"restore_drive"="Ripristina da Google Drive";
"could_not_list_identities_from_google_drive"="Impossibile ottenere la lista delle identità da Google Drive";
"no_google_account_selected"="Nessun account Google scelto";
"select_google_drive_account"="Scegli";
"progress_restoring_identity"="Ripristino identità";
"progress_loading_identities"="Caricamento dei backup delle identitlà";
"progress_backup_identity_drive"="Backup identità in corso";
"progress_drive_dir_check"="Controllo delle cartelle con identità di surespot";
"no_drive_identities"="Nessun backup delle identità caricato da Google Drive";
"no_local_identities"="Nessun backup delle identità trovato sulla Memoria del Dispositivo";
"identity_name"="Nome identità";
"last_backed_up"="Ultimo backup";
"last_modified"="Ultima modifica";
"help"="Aiuto";
"menu_import"="Importa";
"backup_drive"="Fai il backup con Google Drive";
"let_me_select"="Lasciami scegliere";
"could_not_import_identity_drive_404"="Caricamento identità non riuscito - assicurati di aver scelto lo stesso account Google che stavi usando per Google Drive.";
"pick_same_drive_account"="Scegli lo stesso account che stavi usando per Google Drive:";
"about"="Informazioni...";
"about_action_bar_right"="Informazioni";
"unauthorized"="Sessione scaduta, ripeti il login";
"verify_key_fingerprints"="Vedi la firma digitale della chiave";
"received"="Ricevuto";
"version"="Versione";
"public_key_fingerprints"="Firma digitale della chiave pubblica";
"loading"="Caricamento...";
"device_does_not_support_google_drive"="Dispositivo non configurato per Google Drive.";
"login_update"="Aggiorna surespot per effettuare il login";
"billing_payment_required_voice"="Messaggi vocali di surespot non acquistati";
"billing_getting_inventory"="Scarico lista di acquisti, riprova tra qualche secondo";
"billing_unavailable_message"="Devi avere un account Google configurato sul tuo dispositivo per acquistare i messaggi vocali";
"billing_unavailable_title"="Transazione non disponibile";
"billing_error"="Errore di transazione";
"pref_billing"="Acquisti";
"suppress_voice_purchase"="Non chiedermi più di acquistare i messaggi vocali (chiude la scheda)";
"voice_messaging_purchase_1"="Aggiungi i messaggi vocali a surespot per rendere la comunicazione crittografata ancora più facile! Basta tenere premuto il bottone del microfono per registrare e rilasciarlo per inviare. Perché ogni tanto è più facile a dirsi che a scriversi.";
"voice_messaging_purchase_button"="Acquista a %@";
"voice_message_suppress_purchase_ask"="Non chiedermelo più";
"pref_suppress_voice_purchase_ask_title"="Non chiedermelo più";
"pref_suppress_voice_purchase_ask_summary"="Non chiedermi più di acquistare i messaggi vocali";
"menu_purchase_voice_messaging"="Acquista messaggi vocali";
"user_exists_throttled"="Troppi tentativi, riprova più tardi";
"user_exists_error"="Errore durante il controllo dell'username";
"user_exists_progress"="Controllo username";
"voice_help_1"="Tieni premuto il bottone del microfono per registrare un messaggio vocale, rilascialo per inviarlo.";
"voice_help_2"="Per annullare la registrazione sposta il dito lontano dal bottone e rilascia.";
"voice_help_3"="Tocca su un messaggio vocale per riprodurlo, tocca di nuovo per fermarlo.";
"voice_help_4"="I nuovi messaggi vocali verranno riprodotti automaticamente nella scheda di chat aperta.";
"close"="Chiudi";
"no_audio_detected"="Nessun suono rilevato - messaggio vocale non inviato";

/* need translation*/
"menu_copy"="Copia";
"message_hint"="Inserisci messaggio";
"invite_hint"="Invita utente";
"loading_earlier_messages_failed"="Impossibile caricare i messaggi precedenti";
"all_messages_loaded"="Tutti i messaggi caricati";
"save_to_photos"="Salva nelle foto";
"image_saved_to_photos"="Immagine salvata nell'album surespot";
"error_saving_image_to_photos"="Errore durante il salvataggio dell'immagine";
"error_saving_image_to_photos_locked"="Impossibile salvare l'immagine perchè è bloccata";
"could_not_load_public_keys"="Impossibile caricare le chiavi pubbliche";
"share_invite_link"="Condividi link dell'invito";
"Share"="Condividi link usando";
"recording_cancelled"="Registrazione annullata";
"voice_messaging"="Messaggi vocali";
"video_demonstration"="Video demo";
"login_to_validate"="Impossibile validare la ricevuta dell'acquisto, il sistema riproverà al prossimo login";
"surecoin_purchase_complete"="Grazie per aver acquistato dello surecoin!";
"share_link_help"="Usa l'opzione \"condividi link dell'invito\" per condividere un link via email, sms, twitter, o altri social network, che quando cliccato installerà surespot / ti inviterà come amico";
"store_password_in_keychain"="Salva password nel portachiavi";
"menu"="Menu";
"pwyl_text"="Come puoi vedere, surespot è gratis e non ha pubblicità.\n\nTi preghiamo di aiutarci a pagare i costi dei server tramite surecoin.\n\nDiamo una parte di ogni profitto alla EFF in modo che possa continuare a combattere per la nostra libertà.";
"could_not_initialize_voice"="Impossibile avviare la registrazione audio";
"error_downloading_message_data"="Errore durante il download dei dati messaggio";
/*****************************************************/



//links
"eff_match"="EFF";
"eff_link"="https://www.eff.org/issues/privacy";
"end_to_end_match"="end-to-end";
"end_to_end_link"="https://en.wikipedia.org/wiki/End-to-end_encryption";
"symmetric_key_match"="chiave simmetrica";
"symmetric_key_link"="https://en.wikipedia.org/wiki/Symmetric-key_algorithm";
"aes_gcm_match"="256 bit AES-GCM";
"aes_gcm_link"="https://en.wikipedia.org/wiki/Advanced_Encryption_Standard";
"ecdh_link"="https://en.wikipedia.org/wiki/Elliptic_curve_Diffie-Hellman";
"ecdh_match"="ECDH shared secret derivation";
"welcome_to_surespot"="Benvenuto a surespot! I dati inviati usando questa app sono cifrati end-to-end tramite codifica chiave simmetrica (256 bit AES-GCM) usando chiavi generate con 521 bit ECDH shared secret derivation.";

"about_about"="surespot";
"about_website_match"="https://www.surespot.me";
"about_website_link"="https://www.surespot.me";
"tos_match"="termini di servizio";
"tos_link"="https://www.surespot.me/documents/surespot_terms_of_service.html";
"pp_match"="https://www.surespot.me/documents/surespot_privacy_policy.html";
"pp_link"="sulla privacy";
"threat_match"="analisi di dati e minacce";
"threat_link"="https://www.surespot.me/documents/threat.html";
"github_match"="https://github.com/surespot";
"github_link"="https://github.com/surespot";
"howsurespotworks_match"="funziona surespot clicca qui";
"howsurespotworks_link"="https://www.surespot.me/documents/how_surespot_works.html";
"support_match"="supporto tocca qui";
"support_link"="https://www.surespot.me/support.html";
"email_match"="support@surespot.me";
"email_link"="mailto:support@surespot.me";
"about_audio_match"="Marco Angelo";
"about_audio_link"="https://soundcloud.com/merakiaudio";
"about_website"="Visita il sito di surespot su https://www.surespot.me per ulteriori informazioni, tra cui i termini di servizio, informazioni sulla privacy, e analisi di dati e minacce.\nSurespot è 100% a sorgente aperta, o open source, ed è lieta di accogliere la tua partecipazione - puoi vedere il codice sorgente su github all'indirizzo https://github.com/surespot.\nPer un'occhiata più tecnica su come funziona surespot clicca qui.\nPer domande o supporto tocca qui o scrivi a support@surespot.me.\nSuoni di notifica creati da Marco Angelo.";


"aes_match"="AES-GCM a 256 bit";
"aes_link"="http://www.eetimes.com/design/embedded-internet-design/4372428/How-secure-is-AES-against-brute-force-attacks-";
"pbkdf_match"="PBKDF";
"pbkdf_link"="https://en.wikipedia.org/wiki/PBKDF2";
"privatekeys_match"="chiavi private";
"privatekeys_link"="https://en.wikipedia.org/wiki/Public-key_cryptography";
"bruteforce_match"="attacco di forza bruta";
"bruteforce_link"="https://en.wikipedia.org/wiki/Brute-Force_attack";
"strength_match"="robustezza";
"strength_link"="https://en.wikipedia.org/wiki/Password_strength";
"help_backup_what"="In questo modo esporterai una copia dell'identità selezionata, cifrata con AES-GCM a 256 bit usando una chiave derivata dalla tua password attraverso la funzione PBKDF (Password Based Key Derivation Function).\n\nsurespot può fare il backup delle tue identità sia nella cartella dei Documenti, dalla quale saranno disponibili per la condivisione con iTunes, sia su Google Drive.\n\nPer ragioni di sicurezza consigliamo di usare la cartella dei Documenti per il backup. Una volta fatto il backup, il file dell'identità dovrà essere salvato in un posto sicuro mediante iTunes (Condivisione -> Salva), in modo che si possa ripristinare l'identità nel caso di disinstallazione dell'app, ripristino di un precedente backup, smarrimento/furto del telefono o altre eventualità.\n\nSe decidi di fare il backup su Google Drive, ciò significa che salverai una copia delle tue chiavi private sui server di Google Drive. Se qualcuno dovesse in qualche modo riuscire ad accedere a tali server e cercasse di decrittare il file contenente la tua identità con un attacco di forza bruta, sappi che il suo successo dipenderà solo dalla robustezza della tua password.";

"tos_match"="termini di servizio";
"tos_link"="https://www.surespot.me/documents/surespot_terms_of_service.html";
"help_agreement"="Cliccando OK accetti i termini di servizio di surespot.";

"restore_from_documents"="Ripristina dalla cartella dei Documenti.";
"documents"="Documenti";
"google_drive"="Google Drive";
"backup_to_documents"="Fai il backup nei Documenti";
"backed_up_identity_to_documents"="Identità salvata nei Documenti.";
"notification_message"="%1$@: Nuovo messaggio ricevuto.";
"notification_invite"="%1$@: Hai ricevuto un invito.";
"notification_invite_accept"="%1$@: Invito accettato.";
"menu_assign_alias"="Assegna nome";
"could_not_assign_friend_alias"="Impossibile assegnare il nome";
"enter_alias"="Inserisci il nome";
"enter_alias_for"="Inserisci un nome per %@";
"menu_remove_friend_image"="Rimuovi immagine";
"menu_remove_friend_alias"="Rimuovi nome";
"could_not_remove_friend_image"="Impossibile rimuovere l'immagine";
"could_not_remove_friend_alias"="Impossibile rimuovere il nome";
"remove"="Rimuovi";
"decrypt_update"="Si prega di aggiornare surespot per decifrare.";
